app/Controllers/Pendaftaran/Pendaftaran.php

   public function index()
{
    $today = date('Y-m-d');

    /* ======================
       SUMMARY TOTAL
    ====================== */

    $totalPendaftaran = $this->appointmentModel
        ->where('schedule_date', $today)
        ->countAllResults();

    $totalWaiting = $this->appointmentModel
        ->where('status', 'waiting')
        ->where('schedule_date', $today)
        ->countAllResults();

    $totalQueue = $this->queueModel
        ->join('appointments', 'appointments.appointment_id = queues.appointment_id')
        ->where('appointments.schedule_date', $today)
        ->countAllResults();

    /* ======================
       5 PENDAFTARAN TERBARU
    ====================== */

    $pendaftaranTerbaru = $this->appointmentModel
        ->select('
            appointments.status,
            users.full_name,
            departments.name AS department_name
        ')
        ->join('patients', 'patients.patient_id = appointments.patient_id')
        ->join('users', 'users.user_id = patients.user_id')
        ->join('departments', 'departments.department_id = appointments.department_id')
        ->orderBy('appointments.appointment_id', 'DESC')
        ->limit(5)
        ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `schedule_date` = '2026-02-19'
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `status` = 'waiting'
AND `schedule_date` = '2026-02-19'
SELECT COUNT(*) AS `numrows`
FROM `queues`
JOIN `appointments` ON `appointments`.`appointment_id` = `queues`.`appointment_id`
WHERE `appointments`.`schedule_date` = '2026-02-19'
SELECT `appointments`.`status`, `users`.`full_name`, `departments`.`name` AS `department_name`
FROM `appointments`
JOIN `patients` ON `patients`.`patient_id` = `appointments`.`patient_id`
JOIN `users` ON `users`.`user_id` = `patients`.`user_id`
JOIN `departments` ON `departments`.`department_id` = `appointments`.`department_id`
ORDER BY `appointments`.`appointment_id` DESC
 LIMIT 5

       5 ANTRIAN TERBARU
    ====================== */

    $antrianTerbaru = $this->queueModel
    ->select('
        queues.queue_number,
        queues.status,
        users.full_name,
        departments.name AS department_name
    ')
    ->join('appointments', 'appointments.appointment_id = queues.appointment_id')
    ->join('patients', 'patients.patient_id = appointments.patient_id')
    ->join('users', 'users.user_id = patients.user_id')
    ->join('departments', 'departments.department_id = appointments.department_id')
    ->where('appointments.schedule_date', $today) // WAJIB
    ->orderBy('queues.queue_number', 'DESC') // sama seperti dashboard
    ->limit(5)
    ->findAll();
---
SELECT `queues`.`queue_number`, `queues`.`status`, `users`.`full_name`, `departments`.`name` AS `department_name`
FROM `queues`
JOIN `appointments` ON `appointments`.`appointment_id` = `queues`.`appointment_id`
JOIN `patients` ON `patients`.`patient_id` = `appointments`.`patient_id`
JOIN `users` ON `users`.`user_id` = `patients`.`user_id`
JOIN `departments` ON `departments`.`department_id` = `appointments`.`department_id`
WHERE `appointments`.`schedule_date` = '2026-02-19'
ORDER BY `queues`.`queue_number` DESC
 LIMIT 5

    public function pasien()
    {
        $dataPasien = $this->appointmentModel
            ->select('
                appointments.appointment_id,
                appointments.status,
                appointments.schedule_date,
                users.full_name,
                departments.name AS department_name
            ')
            ->join('patients', 'patients.patient_id = appointments.patient_id')
            ->join('users', 'users.user_id = patients.user_id')
            ->join('departments', 'departments.department_id = appointments.department_id')
            ->orderBy('appointments.appointment_id', 'DESC')
            ->findAll();
---
SELECT `appointments`.`appointment_id`, `appointments`.`status`, `appointments`.`schedule_date`, `users`.`full_name`, `departments`.`name` AS `department_name`
FROM `appointments`
JOIN `patients` ON `patients`.`patient_id` = `appointments`.`patient_id`
JOIN `users` ON `users`.`user_id` = `patients`.`user_id`
JOIN `departments` ON `departments`.`department_id` = `appointments`.`department_id`
ORDER BY `appointments`.`appointment_id` DESC

    public function antrian()
    {
        $today = date('Y-m-d');

        $dataAntrian = $this->queueModel
            ->select('
                queues.queue_number,
                queues.status,
                users.full_name,
                departments.name AS department_name
            ')
            ->join('appointments', 'appointments.appointment_id = queues.appointment_id')
            ->join('patients', 'patients.patient_id = appointments.patient_id')
            ->join('users', 'users.user_id = patients.user_id')
            ->join('departments', 'departments.department_id = appointments.department_id')
            ->where('appointments.schedule_date', $today)
            ->orderBy('queues.queue_number', 'ASC')
            ->findAll();
---
SELECT `queues`.`queue_number`, `queues`.`status`, `users`.`full_name`, `departments`.`name` AS `department_name`
FROM `queues`
JOIN `appointments` ON `appointments`.`appointment_id` = `queues`.`appointment_id`
JOIN `patients` ON `patients`.`patient_id` = `appointments`.`patient_id`
JOIN `users` ON `users`.`user_id` = `patients`.`user_id`
JOIN `departments` ON `departments`.`department_id` = `appointments`.`department_id`
WHERE `appointments`.`schedule_date` = '2026-02-19'
ORDER BY `queues`.`queue_number` ASC