app/Controllers/Admin/Users.php

    public function index()
    {
        // Join tabel users dengan roles agar nama role muncul (bukan angka ID)
        $data['users'] = $this->userModel
            ->select('users.*, roles.role_name')
            ->join('roles', 'roles.role_id = users.role_id')
            ->findAll();
---
SELECT `users`.*, `roles`.`role_name`
FROM `users`
JOIN `roles` ON `roles`.`role_id` = `users`.`role_id`

    public function edit($id)
    {
        $user = $this->userModel->find($id);

        if (!$user) {
            return redirect()->to('/admin/users')->with('error', 'User tidak ditemukan');
        }

        // Ambil role
        $role = $this->roleModel->find($user['role_id']);

        // Ambil data dokter (jika role dokter)
        $doctor = null;
        if ($role && $role['role_name'] === 'dokter') {
            $doctor = $this->doctorModel
                ->where('user_id', $id)
                ->first();
        }

        $data = [
            'user'        => $user,
            'roles'       => $this->roleModel->findAll(),
            'departments' => $this->departmentModel->findAll(),
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '1'
SELECT *
FROM `roles`
WHERE `roles`.`role_id` = '1'
SELECT *
FROM `roles`
SELECT *
FROM `departments`