app/Controllers/Apoteker/Apoteker.php

    public function getDetail($id)
    {
        $items = $this->item
            ->select('prescription_items.quantity, medicines.name')
            ->join('medicines', 'medicines.medicine_id = prescription_items.medicine_id')
            ->where('prescription_id', $id)
            ->findAll();
---
SELECT `prescription_items`.`quantity`, `medicines`.`name`
FROM `prescription_items`
JOIN `medicines` ON `medicines`.`medicine_id` = `prescription_items`.`medicine_id`
WHERE `prescription_id` = '1'

    public function pickup($id)
    {
        $db = \Config\Database::connect();

        // Cegah double pickup
        if ($this->pickup->where('prescription_id', $id)->first()) {
            return redirect()->back()->with('error', 'Resep sudah diambil sebelumnya.');
        }

        $db->transStart();

        $items = $this->item->where('prescription_id', $id)->findAll();

        foreach ($items as $item) {
            $this->medicine
                ->set('stock', 'stock - ' . $item['quantity'], false)
                ->where('medicine_id', $item['medicine_id'])
                ->update();
---
UPDATE `medicines` SET `stock` = stock - 1
WHERE `medicine_id` = '9'