app/Controllers/Doctor/DoctorController.php

SELECT *
FROM `doctors`
WHERE `user_id` = '19'
SELECT `appointments`.`appointment_id`, `appointments`.`schedule_date`, `appointments`.`created_at`, `users`.`full_name` as `patient_name`, `queues`.`queue_number`, `queues`.`status` as `queue_status`
FROM `appointments`
JOIN `patients` ON `patients`.`patient_id` = `appointments`.`patient_id`
JOIN `users` ON `users`.`user_id` = `patients`.`user_id`
JOIN `queues` ON `queues`.`appointment_id` = `appointments`.`appointment_id`
WHERE `appointments`.`department_id` = '2'
AND `appointments`.`status` = 'confirmed'
AND `queues`.`status` IN ('waiting','called')
ORDER BY `queues`.`queue_number` ASC
---
    public function index()
    {
        $db = \Config\Database::connect();
        $appointmentModel = new AppointmentModel();

        $userId = session()->get('user_id');

        $dokterData = $db->table('doctors')
            ->where('user_id', $userId)
            ->get()
            ->getRow();

        if (!$dokterData) {
            return view('doctor/dashboard', ['patients' => []]);
        }

        $doctorDepartmentId = $dokterData->department_id;

        $data['patients'] = $appointmentModel
            ->select('
            appointments.appointment_id,
            appointments.schedule_date,
            appointments.created_at,
            users.full_name as patient_name,
            queues.queue_number,
            queues.status as queue_status
        ')
            ->join('patients', 'patients.patient_id = appointments.patient_id')
            ->join('users', 'users.user_id = patients.user_id')
            ->join('queues', 'queues.appointment_id = appointments.appointment_id')
            ->where('appointments.department_id', $doctorDepartmentId) // 🔥 FIX
            ->where('appointments.status', 'confirmed')
            ->whereIn('queues.status', ['waiting', 'called'])
            ->orderBy('queues.queue_number', 'ASC')
            ->findAll();